[
  {
    "id": "gfFCRaUIB40C",
    "title": "The Dog Shogun",
    "author": "Beatrice M. Bodart-Bailey",
    "publisher": "University of Hawaii Press",
    "publishedDate": "2006",
    "description": "Tsunayoshi (1646 1709), the fifth Tokugawa shogun, is one of the most notorious figures in Japanese history. Viewed by many as a tyrant, his policies were deemed eccentric, extreme, and unorthodox. His Laws of Compassion, which made the maltreatment of dogs an offense punishable by death, earned him the nickname Dog Shogun, by which he is still popularly known today. However, Tsunayoshi s rule coincides with the famed Genroku era, a period of unprecedented cultural growth and prosperity that Japan would not experience again until the mid-twentieth century. It was under Tsunayoshi that for the first time in Japanese history considerable numbers of ordinary townspeople were in a financial position to acquire an education and enjoy many of the amusements previously reserved for the ruling elite. Based on a masterful re-examination of primary sources, this exciting new work by a senior scholar of the Tokugawa period maintains that Tsunayoshi s notoriety stems largely from the work of samurai historians and officials who saw their privileges challenged by a ruler sympathetic to commoners. Beatrice Bodart-Bailey s insightful analysis of Tsunayoshi s background sheds new light on his personality and the policies associated with his shogunate. Tsunayoshi was the fourth son of Tokugawa Iemitsu (1604 1651) and left largely in the care of his mother, the daughter of a greengrocer. Under her influence, Bodart-Bailey argues, the future ruler rebelled against the values of his class. As evidence she cites the fact that, as shogun, Tsunayoshi not only decreed the registration of dogs, which were kept in large numbers by samurai and posed a threat to the populace, but also the registration of pregnant women and young children to prevent infanticide. He decreed, moreover, that officials take on the onerous tasks of finding homes for abandoned children and caring for sick travelers. In the eyes of his detractors, Tsunayoshi s interest in Confucian and Buddhist studies and his other intellectual pursuits were merely distractions for a dilettante. Bodart-Bailey counters that view by pointing out that one of Japan s most important political philosophers, Ogyu Sorai, learned his craft under the fifth shogun. Sorai not only praised Tsunayoshi s government, but his writings constitute the theoretical framework for many of the ruler s controversial policies. Another salutary aspect of Tsunayoshi s leadership that Bodart-Bailey brings to light is his role in preventing the famines and riots that would have undoubtedly taken place following the worst earthquake and tsunami as well as the most violent eruption of Mount Fuji in history all of which occurred during the final years of Tsunayoshi's shogunate. The Dog Shogun is a thoroughly revisionist work of Japanese political history that touches on many social, intellectual, and economic developments as well. As such it promises to become a standard text on late-seventeenth and early-eighteenth-century Japan.",
    "pageCount": 378,
    "Genre": "History",
    "imageUrl": {
      "image1": "http://books.google.com/books/content?id=gfFCRaUIB40C&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=gfFCRaUIB40C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "id": "-ym4Fcw4rVoC",
    "title": "Shoguns City",
    "author": "Noel Nouet",
    "publisher": "Routledge",
    "publishedDate": "2013-01-11",
    "description": "First Published in 1995. Routledge is an imprint of Taylor & Francis, an informa company.",
    "pageCount": 256,
    "Genre": "Social Science",
    "imageUrl": {
      "image1": "http://books.google.com/books/content?id=-ym4Fcw4rVoC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=-ym4Fcw4rVoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "id": "cWAF8_uH1_sC",
    "title": "Shogun",
    "author": "James Clavell",
    "publisher": "Dell",
    "publishedDate": "2009-02-19",
    "description": "A bold English adventurer. An invincible Japanese warlord. A beautiful woman torn between two ways of life, two ways of love. All brought together in an extraordinary saga of a time and a place aflame with conflict, passion, ambition, lust, and the struggle for power... From the Paperback edition.",
    "pageCount": 1152,
    "Genre": "Fiction",
    "imageUrl": {
      "image1": "http://books.google.com/books/content?id=cWAF8_uH1_sC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=cWAF8_uH1_sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "id": "tqqu3D6E8WEC",
    "title": "Tokyo",
    "author": "Sumiko Enbutsu",
    "publisher": "Kodansha International",
    "publishedDate": "2007-02-26",
    "description": "Heart of the old city - Sumo quarters - Haiku poet Basho - Kabuki - Fish markets - Samurai feats - Shoguns - Classic temple district - Shops and festivals - Traditional Tokyo neighbourhood.",
    "pageCount": 79,
    "Genre": "Travel",
    "imageUrl": {
      "image1": "http://books.google.com/books/content?id=tqqu3D6E8WEC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=tqqu3D6E8WEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "id": "KJ9XXwAACAAJ",
    "title": "Shogun & Daimyo",
    "author": "Tadashi Ehara",
    "publisher": "undefined",
    "publishedDate": "2011-09",
    "description": "The samurai ruled the Land of the Rising Sun from the end of the 12th century to the middle of the 19th century. The information in this resource is organized as a handbook for creating more realistic backgrounds for role-playing games, boardgames, miniatures games, and computer games.",
    "pageCount": 342,
    "Genre": "Games & Activities",
    "imageUrl": {
      "image1": "http://books.google.com/books/content?id=KJ9XXwAACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=KJ9XXwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    }
  },
  {
    "id": "5HhzBgAAQBAJ",
    "title": "Shogun",
    "author": "A. L. Sadler",
    "publisher": "Tuttle Publishing",
    "publishedDate": "2009-07-10",
    "description": "This book tells the fascinating history of the life of Shogun Tokugawa Ieyasu — Japan's most famous Shogun. Since its initial appearance, A.L.Sadler's imposing biography of the Japanese Shogun Tokugawa Ieyasu has been recognized as an outstanding contribution to the knowledge of Japanese history. It is also considered the standard reference work on the period that saw the entrenchment of feudalism in Japan and the opening of some two and a half centuries of rigid isolation from the rest of the world. In the course of Japanese history there have been five great military leaders who by common consent stand out above the others of their type. Of these, two lived in the twelfth century, while the other three, Oda Nobunaga, Toyotomi Hideyoshi, and Tokugawa Ieyasu, were contemporary in the latter half of the sixteenth century. The last of these three, with whose life Mr. Sadler deals, may well be described as having perfected the shogunate system. Not only did Ieyasu found a dynasty of rulers and organize a powerful system of government, but also he rounded off his achievements by contriving before his death to arrange for his deification afterwards. As Mr. Sadler notes, Tokugawa Ieyasu is unquestionably one of the greatest men the world has yet seen, and this fascinating account of Ieyasu's life and times is presented in a thoroughly absorbing narrative in which dramatic highlights abound. Japan's feudal age came to a close in 1868 with the downfall of the Tokugawa Shogunate and the restoration of the Emperor to political power. The event marked the end of the powerful regime that Ieyasu established at the beginning of the seventeenth century. That it did not at the same time mark the eclipse of Ieyasu's greatness is sufficient testimony to the major role he played in his country's history. It is to to A. L. Sadler's lasting credit that he has brought this eminent but often ruthless military leader so vividly to life.",
    "pageCount": 384,
    "Genre": "History",
    "imageUrl": {
      "image1": "http://books.google.com/books/content?id=5HhzBgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=5HhzBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "id": "LZYz2gTl90MC",
    "title": "The Shogun's Daughter",
    "author": "Laura Joh Rowland",
    "publisher": "Minotaur Books",
    "publishedDate": "2013-09-17",
    "description": "Japan, 1704. In an elegant mansion a young woman named Tsuruhime lies on her deathbed, attended by her nurse. Smallpox pustules cover her face. Incense burns, to banish the evil spirits of disease. After Tsuruhime takes her last breath, the old woman watching from the doorway says, Who's going to tell the Shogun his daughter is dead? The death of the Shogun's daughter has immediate consequences on his regime. There will be no grandchild to leave the kingdom. Faced with his own mortality and beset by troubles caused by the recent earthquake, he names as his heir Yoshisato, the seventeen-year-old son he only recently discovered was his. Until five months ago, Yoshisato was raised as the illegitimate son of Yanagisawa, the shogun's favorite advisor. Yanagisawa is also the longtime enemy of Sano Ichiro. Sano doubts that Yoshisato is really the Shogun's son, believing it's more likely a power-play by Yanagisawa. When Sano learns that Tsuruhime's death may have been a murder, he sets off on a dangerous investigation that leads to more death and destruction as he struggles to keep his pregnant wife, Reiko, and his son safe. Instead, he and his family become the accused. And this time, they may not survive the day. Laura Joh Rowland's thrilling series set in Feudal Japan is as gripping and entertaining as ever.",
    "pageCount": 336,
    "Genre": "Fiction",
    "imageUrl": {
      "image1": "http://books.google.com/books/content?id=LZYz2gTl90MC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=LZYz2gTl90MC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "id": "AU9YtwAACAAJ",
    "title": "Fahrenheit 451",
    "author": "Ray Bradbury",
    "publishedDate": "1968",
    "description": "A fireman in charge of burning books meets a revolutionary school teacher who dares to read. Depicts a future world in which all printed reading material is burned.",
    "pageCount": 147,
    "Genre": "Science Fiction",
    "imageUrl": {
      "image1": "http://books.google.com/books/content?id=AU9YtwAACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=AU9YtwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    }
  },
  {
    "id": "ZjIrmQEACAAJ",
    "title": "Adi Parva",
    "author": "Amruta Patil",
    "publisher": "Harpercollins",
    "publishedDate": "2012-11-29",
    "description": "From the bestselling author of Kari comes a brilliant new interpretation of mythology. Combining stories from the Adi Parva which precede the main narrative of the Pandav-Kaurav war for succession.",
    "pageCount": 276,
    "Genre": "Fantassy",
    "imageUrl": {
      "image1": "http://books.google.com/books/content?id=ZjIrmQEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=ZjIrmQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    }
  }
]
