[
  {
    "id": "gfFCRaUIB40C",
    "title": "The Dog Shogun",
    "author": "Beatrice M. Bodart-Bailey",
    "publisher": "University of Hawaii Press",
    "publishedDate": "2006",
    "description": "Tsunayoshi (1646 1709), the fifth Tokugawa shogun, is one of the most notorious figures in Japanese history. Viewed by many as a tyrant, his policies were deemed eccentric, extreme, and unorthodox. His Laws of Compassion, which made the maltreatment of dogs an offense punishable by death, earned him the nickname Dog Shogun, by which he is still popularly known today. However, Tsunayoshi s rule coincides with the famed Genroku era, a period of unprecedented cultural growth and prosperity that Japan would not experience again until the mid-twentieth century. It was under Tsunayoshi that for the first time in Japanese history considerable numbers of ordinary townspeople were in a financial position to acquire an education and enjoy many of the amusements previously reserved for the ruling elite. Based on a masterful re-examination of primary sources, this exciting new work by a senior scholar of the Tokugawa period maintains that Tsunayoshi s notoriety stems largely from the work of samurai historians and officials who saw their privileges challenged by a ruler sympathetic to commoners. Beatrice Bodart-Bailey s insightful analysis of Tsunayoshi s background sheds new light on his personality and the policies associated with his shogunate. Tsunayoshi was the fourth son of Tokugawa Iemitsu (1604 1651) and left largely in the care of his mother, the daughter of a greengrocer. Under her influence, Bodart-Bailey argues, the future ruler rebelled against the values of his class. As evidence she cites the fact that, as shogun, Tsunayoshi not only decreed the registration of dogs, which were kept in large numbers by samurai and posed a threat to the populace, but also the registration of pregnant women and young children to prevent infanticide. He decreed, moreover, that officials take on the onerous tasks of finding homes for abandoned children and caring for sick travelers. In the eyes of his detractors, Tsunayoshi s interest in Confucian and Buddhist studies and his other intellectual pursuits were merely distractions for a dilettante. Bodart-Bailey counters that view by pointing out that one of Japan s most important political philosophers, Ogyu Sorai, learned his craft under the fifth shogun. Sorai not only praised Tsunayoshi s government, but his writings constitute the theoretical framework for many of the ruler s controversial policies. Another salutary aspect of Tsunayoshi s leadership that Bodart-Bailey brings to light is his role in preventing the famines and riots that would have undoubtedly taken place following the worst earthquake and tsunami as well as the most violent eruption of Mount Fuji in history all of which occurred during the final years of Tsunayoshi's shogunate. The Dog Shogun is a thoroughly revisionist work of Japanese political history that touches on many social, intellectual, and economic developments as well. As such it promises to become a standard text on late-seventeenth and early-eighteenth-century Japan.",
    "pageCount": 378,
    "Genre": "History",
    "imageUrl": {
      "image1": "http://books.google.com/books/content?id=gfFCRaUIB40C&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=gfFCRaUIB40C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "id": "-ym4Fcw4rVoC",
    "title": "Shoguns City",
    "author": "Noel Nouet",
    "publisher": "Routledge",
    "publishedDate": "2013-01-11",
    "description": "First Published in 1995. Routledge is an imprint of Taylor & Francis, an informa company.",
    "pageCount": 256,
    "Genre": "Social Science",
    "imageUrl": {
      "image1": "http://books.google.com/books/content?id=-ym4Fcw4rVoC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=-ym4Fcw4rVoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "id": "cWAF8_uH1_sC",
    "title": "Shogun",
    "author": "James Clavell",
    "publisher": "Dell",
    "publishedDate": "2009-02-19",
    "description": "A bold English adventurer. An invincible Japanese warlord. A beautiful woman torn between two ways of life, two ways of love. All brought together in an extraordinary saga of a time and a place aflame with conflict, passion, ambition, lust, and the struggle for power... From the Paperback edition.",
    "pageCount": 1152,
    "Genre": "Fiction",
    "imageUrl": {
      "image1": "http://books.google.com/books/content?id=cWAF8_uH1_sC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=cWAF8_uH1_sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "id": "tqqu3D6E8WEC",
    "title": "Tokyo",
    "author": "Sumiko Enbutsu",
    "publisher": "Kodansha International",
    "publishedDate": "2007-02-26",
    "description": "Heart of the old city - Sumo quarters - Haiku poet Basho - Kabuki - Fish markets - Samurai feats - Shoguns - Classic temple district - Shops and festivals - Traditional Tokyo neighbourhood.",
    "pageCount": 79,
    "Genre": "Travel",
    "imageUrl": {
      "image1": "http://books.google.com/books/content?id=tqqu3D6E8WEC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=tqqu3D6E8WEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "id": "KJ9XXwAACAAJ",
    "title": "Shogun & Daimyo",
    "author": "Tadashi Ehara",
    "publisher": "undefined",
    "publishedDate": "2011-09",
    "description": "The samurai ruled the Land of the Rising Sun from the end of the 12th century to the middle of the 19th century. The information in this resource is organized as a handbook for creating more realistic backgrounds for role-playing games, boardgames, miniatures games, and computer games.",
    "pageCount": 342,
    "Genre": "Games & Activities",
    "imageUrl": {
      "image1": "http://books.google.com/books/content?id=KJ9XXwAACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=KJ9XXwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    }
  },
  {
    "id": "5HhzBgAAQBAJ",
    "title": "Shogun",
    "author": "A. L. Sadler",
    "publisher": "Tuttle Publishing",
    "publishedDate": "2009-07-10",
    "description": "This book tells the fascinating history of the life of Shogun Tokugawa Ieyasu — Japan's most famous Shogun. Since its initial appearance, A.L.Sadler's imposing biography of the Japanese Shogun Tokugawa Ieyasu has been recognized as an outstanding contribution to the knowledge of Japanese history. It is also considered the standard reference work on the period that saw the entrenchment of feudalism in Japan and the opening of some two and a half centuries of rigid isolation from the rest of the world. In the course of Japanese history there have been five great military leaders who by common consent stand out above the others of their type. Of these, two lived in the twelfth century, while the other three, Oda Nobunaga, Toyotomi Hideyoshi, and Tokugawa Ieyasu, were contemporary in the latter half of the sixteenth century. The last of these three, with whose life Mr. Sadler deals, may well be described as having perfected the shogunate system. Not only did Ieyasu found a dynasty of rulers and organize a powerful system of government, but also he rounded off his achievements by contriving before his death to arrange for his deification afterwards. As Mr. Sadler notes, Tokugawa Ieyasu is unquestionably one of the greatest men the world has yet seen, and this fascinating account of Ieyasu's life and times is presented in a thoroughly absorbing narrative in which dramatic highlights abound. Japan's feudal age came to a close in 1868 with the downfall of the Tokugawa Shogunate and the restoration of the Emperor to political power. The event marked the end of the powerful regime that Ieyasu established at the beginning of the seventeenth century. That it did not at the same time mark the eclipse of Ieyasu's greatness is sufficient testimony to the major role he played in his country's history. It is to to A. L. Sadler's lasting credit that he has brought this eminent but often ruthless military leader so vividly to life.",
    "pageCount": 384,
    "Genre": "History",
    "imageUrl": {
      "image1": "http://books.google.com/books/content?id=5HhzBgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=5HhzBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "id": "LZYz2gTl90MC",
    "title": "The Shogun's Daughter",
    "author": "Laura Joh Rowland",
    "publisher": "Minotaur Books",
    "publishedDate": "2013-09-17",
    "description": "Japan, 1704. In an elegant mansion a young woman named Tsuruhime lies on her deathbed, attended by her nurse. Smallpox pustules cover her face. Incense burns, to banish the evil spirits of disease. After Tsuruhime takes her last breath, the old woman watching from the doorway says, Who's going to tell the Shogun his daughter is dead? The death of the Shogun's daughter has immediate consequences on his regime. There will be no grandchild to leave the kingdom. Faced with his own mortality and beset by troubles caused by the recent earthquake, he names as his heir Yoshisato, the seventeen-year-old son he only recently discovered was his. Until five months ago, Yoshisato was raised as the illegitimate son of Yanagisawa, the shogun's favorite advisor. Yanagisawa is also the longtime enemy of Sano Ichiro. Sano doubts that Yoshisato is really the Shogun's son, believing it's more likely a power-play by Yanagisawa. When Sano learns that Tsuruhime's death may have been a murder, he sets off on a dangerous investigation that leads to more death and destruction as he struggles to keep his pregnant wife, Reiko, and his son safe. Instead, he and his family become the accused. And this time, they may not survive the day. Laura Joh Rowland's thrilling series set in Feudal Japan is as gripping and entertaining as ever.",
    "pageCount": 336,
    "Genre": "Fiction",
    "imageUrl": {
      "image1": "http://books.google.com/books/content?id=LZYz2gTl90MC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=LZYz2gTl90MC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "id": "AU9YtwAACAAJ",
    "title": "Fahrenheit 451",
    "author": "Ray Bradbury",
    "publishedDate": "1968",
    "description": "A fireman in charge of burning books meets a revolutionary school teacher who dares to read. Depicts a future world in which all printed reading material is burned.",
    "pageCount": 147,
    "Genre": "Science Fiction",
    "imageUrl": {
      "image1": "http://books.google.com/books/content?id=AU9YtwAACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=AU9YtwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    }
  },
  {
    "id": "ZjIrmQEACAAJ",
    "title": "Adi Parva",
    "author": "Amruta Patil",
    "publisher": "Harpercollins",
    "publishedDate": "2012-11-29",
    "description": "From the bestselling author of Kari comes a brilliant new interpretation of mythology. Combining stories from the Adi Parva which precede the main narrative of the Pandav-Kaurav war for succession.",
    "pageCount": 276,
    "Genre": "Fantassy",
    "imageUrl": {
      "image1": "http://books.google.com/books/content?id=ZjIrmQEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=ZjIrmQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    }
  },
  {
    "id": "r119-dYq0mwC",
    "title": "A Wrinkle in Time",
    "author": "Madeleine L'Engle",
    "publisher": "Farrar, Straus and Giroux (BYR)",
    "publishedDate": "2010-04-01",
    "description": "Madeleine L'Engle's ground-breaking science fiction and fantasy classic, soon to be a major motion picture. It was a dark and stormy night; Meg Murry, her small brother Charles Wallace, and her mother had come down to the kitchen for a midnight snack when they were upset by the arrival of a most disturbing stranger. 'Wild nights are my glory,' the unearthly stranger told them. 'I just got caught in a downdraft and blown off course. Let me sit down for a moment, and then I'll be on my way. Speaking of ways, by the way, there is such a thing as a tesseract.' A tesseract (in case the reader doesn't know) is a wrinkle in time. To tell more would rob the reader of the enjoyment of Miss L'Engle's unusual book. A Wrinkle in Time, winner of the Newbery Medal in 1963, is the story of the adventures in space and time of Meg, Charles Wallace, and Calvin O'Keefe (athlete, student, and one of the most popular boys in high school). They are in search of Meg's father, a scientist who disappeared while engaged in secret work for the government on the tesseract problem. A Wrinkle in Time is the winner of the 1963 Newbery Medal. It is the first book in The Time Quintet, which consists of A Wrinkle in Time, A Wind in the Door, A Swiftly Tilting Planet, Many Waters, and An Acceptable Time. A Wrinkle in Time is soon to be a movie from Disney, directed by Ava DuVernay, starring Storm Reid, Oprah Winfrey, Reese Witherspoon and Mindy Kaling. This title has Common Core connections. Books by Madeleine L'Engle A Wrinkle in Time Quintet A Wrinkle in Time A Wind in the Door A Swiftly Tilting Planet Many Waters An Acceptable Time A Wrinkle in Time: The Graphic Novel by Madeleine L'Engle; adapted & illustrated by Hope Larson Intergalactic P.S. 3 by Madeleine L'Engle; illustrated by Hope Larson: A standalone story set in the world of A Wrinkle in Time. The Austin Family Chronicles Meet the Austins (Volume 1) The Moon by Night (Volume 2) The Young Unicorns (Volume 3) A Ring of Endless Light (Volume 4) A Newbery Honor book! Troubling a Star (Volume 5) The Polly O'Keefe books The Arm of the Starfish Dragons in the Waters A House Like a Lotus And Both Were Young Camilla The Joys of Love",
    "pageCount": 216,
    "Genre": "Science Fiction",
    "imageUrl": {
      "image1": "http://books.google.com/books/content?id=r119-dYq0mwC&printsec=frontcover&img=1&zoom=5&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=r119-dYq0mwC&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    }
  },
  {
    "id": "KJ9GDwAAQBAJ",
    "title": "The World of A Wrinkle in Time",
    "author": "Disney",
    "publisher": "Farrar, Straus and Giroux (Byr)",
    "publishedDate": "2018-02-06",
    "description": "The Making Of A Wrinkle In Time is a perfect companion to Disney's upcoming movie adaptation of the timeless novel! This keepsake book takes readers behind the scenes of the film, complete with interviews, photographs, and details about production, costumes, characters, and the world of Wrinkle and its author, Madeleine L'Engle. Highly visual, entertaining, and informative, The Making of A Wrinkle In Time is perfect for moviegoers and fans of this iconic story.",
    "pageCount": 144,
    "Genre": "Art",
    "imageUrl": {
      "image1": "http://books.google.com/books/content?id=KJ9GDwAAQBAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=KJ9GDwAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    }
  },
  {
    "id": "z4S0swEACAAJ",
    "title": "A Wrinkle in Time: A Guide to the Universe",
    "author": "Kari Sutherland",
    "publisher": "Disney Press",
    "publishedDate": "2018-03-06",
    "description": "Here's your chance to experience the fantastical world of A Wrinkle in Time, the upcoming film from Walt Disney Studios. This colorful book is filled with never-before-seen looks at the characters and places. Get the chance to experience the fantastical world of the upcoming Walt Disney Studios film, A Wrinkle in Time. From the alien Aunt Beast to the skies of the planet Uriel, from the celestial beings known as Mrs. Which, Mrs. Whatsit, and Mrs. Who to the mysterious Happy Medium, this book brings the characters and places from A Wrinkle in Time to life, with stunning full-color illustrations throughout.",
    "pageCount": 192,
    "Genre": "Fiction",
    "imageUrl": {
      "image1": "http://books.google.com/books/content?id=z4S0swEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=z4S0swEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    }
  },

  {
    "id": "QURmCwAAQBAJ",
    "title": "Walking on Water",
    "author": "Madeleine L'Engle",
    "publisher": "Convergent Books",
    "publishedDate": "2016-10-11",
    "description": "In this classic book, Madeleine L'Engle addresses the questions, What makes art Christian? What does it mean to be a Christian artist? What is the relationship between faith and art? Through L'Engle's beautiful and insightful essay, readers will find themselves called to what the author views as the prime tasks of an artist: to listen, to remain aware, and to respond to creation through one's own art.",
    "pageCount": 272,
    "Genre": "Religion",
    "imageUrl": {
      "image1": "http://books.google.com/books/content?id=QURmCwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=QURmCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "id": "0vFJMgEACAAJ",
    "title": "Sivakamiyin Sabadham",
    "author": "Kalki Krishnamurthy",
    "publisher": "Createspace Independent Pub",
    "publishedDate": "2012-09-01",
    "description": "Watch a video trailer of the book at http: //www.youtube.com/watch?v=bUKU79U_P1w Sivakami! If you agree, I will leave the kingdom to its fate and stay with you. You are more important to me than the kingdom...Momentous words uttered by Narasimha Varmar, whose political stature has grown considerably after defeating Durvineethan, King of Ganga Nadu, at the historic Battle of Pullalur. But there are more obstacles to overcome. Mahendra Pallavar, after restraining the Chalukya forces for nine months at the northern border of the Pallava kingdom, is on his way back to Kanchi and continues to oppose the unsuitable alliance. The Chalukya army is rapidly marching towards Kanchi. Naganandi Adigal along with his coterie of faithful bikshus travels across the length and breadth of South India, enlisting support for Pulikesi. The Pallavas, not to be outdone, have considerably strengthened the Kanchi Fort under the able leadership of Mamallar and the newly appointed commander of the Kanchi Fort, Paranjyothi. Expecting the Chalukyas to lay siege to the Kanchi Fort, food supplies that will sustain the citizens residing within the fort for several months have been accumulated. Kalki Krishnamurthy's gripping narrative describes the tremendous efforts of the Pallavas to counter the Chalukya invasion and the growing intimacy between Mamallar and Sivakami in the action-packed second volume of Sivakamiyin Sabadham. Excerpts from this volume may be read at http: //sivakamiyinsabadham.litintrans.com/",
    "pageCount": 254,
    "Genre": "Fiction",
    "imageUrl": {
      "image1": "http://books.google.com/books/content?id=0vFJMgEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=0vFJMgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    }
  },
  {
    "id": "ciYaAQAAIAAJ",
    "title": "Sivakamiyin Sabadam",
    "author": "Kalki",
    "publishedDate": "2008",
    "description": "Based on Narasimhavarman I, King of Kanchi, fl. 630-668.",
    "pageCount": 853,
    "Genre": "Fiction",
    "imageUrl": {
      "image1": "http://books.google.com/books/content?id=ciYaAQAAIAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=ciYaAQAAIAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    }
  },
  {
    "id": "gOuOBAAAQBAJ",
    "title": "Kalki Krishnamurthy's Sivakamiyin Sabadham - An English Translation",
    "author": "Kalki Krishnamurthy",
    "publisher": "Litintrans",
    "publishedDate": "2014-09-27",
    "description": "Watch a video trailer of the book at http://www.youtube.com/watch?v=bUKU79U_P1w A masterpiece by Kalki Krishnamurthy, recipient of India’s highest literary honour – the Sahitya Akademi Award, ‘Sivakamiyin Sabadham’ is a historical Tamil novel set in 7th century South India. The struggle for supremacy between the Chalukya Emperor, Pulikesi II, and the Pallava Emperor, Mahendra Varmar and at a later stage his son, Narasimha Varmar, forms the core of the novel. The story begins with Pulikesi’s unanticipated invasion of the Pallava Kingdom and the ruses Mahendra Varmar employs to safeguard his kingdom and the capital, Kanchi. Mahendra Varmar is handicapped by his ill equipped smaller army which is no match to the larger Chalukya army. Pulikesi’s invasion is not Mahendra Varmar’s sole cause for concern. The impractical yet ardent romance between his only son, Crown Prince Narasimha Varmar and the beautiful and talented danseuse, Sivakami, the daughter of the land’s foremost sculptor, Aayanar, and the fate of Mamallapuram which Mahendra Varmar is in the midst of converting in to a “dream world” filled with exquisite sculptures weigh heavily on him. The scheming Chalukya loyalist Naganandi Bikshu, the young and brave Pallava army commander Paranjyothi, the mysterious Vajrabahu, the passionate sculptor Aayanar and the Pallava spies Shatrugnan and Gundodharan aid in the story’s progression . This intense and unforgettable narrative by Kalki Krishnamurthy plays on the emotions of the readers and concludes with a least expected climax.",
    "pageCount": 253,
    "Genre": "Fiction",
    "imageUrl": {
      "image1": "http://books.google.com/books/content?id=gOuOBAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=gOuOBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "id": "codkAAAAMAAJ",
    "title": "Parthiban's Dream",
    "author": "Kalki",
    "publishedDate": "2006",
    "description": "Traces the fall and the final realization of the illustrious King Prathiban Chola's dream of an all powerful Chola empire and the exploits of the Pallava king, Narsimhan Varman.",
    "pageCount": 240,
    "Genre": "Fiction",
    "imageUrl": {
      "image1": "http://books.google.com/books/content?id=codkAAAAMAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=codkAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    }
  },
  {
    "id": "UkijEVn4Db0C",
    "title": "Alai Osai",
    "author": "Kalki",
    "publisher": "Sixthsense Publications",
    "publishedDate": "2009",
    "pageCount": 856,
    "Genre": "Fiction",
    "imageUrl": {
      "image1": "http://books.google.com/books/content?id=UkijEVn4Db0C&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=UkijEVn4Db0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "id": "B63l8_yh2BkC",
    "title": "The Third Option",
    "author": "Vince Flynn",
    "publisher": "Simon and Schuster",
    "publishedDate": "2008-09-04",
    "description": "THE NEW YORK TIMES NUMBER ONE BESTSELLER Mitch Rapp, the CIA's top counterterrorism operative, is sent on his final mission, to eliminate a European industrialist who has been selling sensitive equipment to one of terrorism's most notorious sponsors. But he doesn't know that the ultimate target of this mission is himself. Set up by forces within the US who do not want the next Director-elect of the CIA to take over, and therefore need a disaster for the present regime, Mitch refuses to die ... the conspirators have made an awful miscalculation. They have enraged one of the most lethal and efficient killers the CIA has ever produced. Now they will pay. AMERICAN ASSASSIN, book one in the series, is soon to be a MAJOR MOTION PICTURE starring Dylan O'Brien (Maze Runner), Taylor Kitsch (True Detective) and Michael Keaton. Praise for the Mitch Rapp series Sizzles with inside information and CIA secrets Dan Brown A cracking, uncompromising yarn that literally takes no prisoners The Times Vince Flynn clearly has one eye on Lee Child's action thriller throne with this twist-laden story. . . instantly gripping Shortlist Action-packed, in-your-face, adrenalin-pumped super-hero macho escapist fiction that does exactly what it says on the label Irish Independent",
    "pageCount": 368,
    "Genre": "Fiction",
    "imageUrl": {
      "image1": "http://books.google.com/books/content?id=B63l8_yh2BkC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=B63l8_yh2BkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  }
]
